In [1]:
import pandas as pd

s1={'hari':30,'deepu':40,'keerthi':50,'siri':60}
s1=pd.Series(s1)
print(s1)
s2={'hari':40,'deepu':58,'keerthi':45,'siri':40}
s2=pd.Series(s2)
print(s2)

hari       30
deepu      40
keerthi    50
siri       60
dtype: int64
hari       40
deepu      58
keerthi    45
siri       40
dtype: int64

In [2]:
final={'s1':s1,'s2':s2}
final=pd.DataFrame(final)
final

         s1  s2
hari     30  40
deepu    40  58
keerthi  50  45
siri     60  40

In [1]:
import pandas as pd
income=pd.read_csv("income.csv")




income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

## Average income of Alaska in all years

In [19]:

s=0
c=0
for i in range(2,11):
    
    s+=income.values[1][i]
    c+=1
    
avg=s//c
print(avg)

60106

## Average income of all states in 2012

In [6]:
s=0
c=0
for i in income.values:
    s+=i[9]
    c+=1
avg=int(s/c)
print(avg)

50038

## create a function to print all colums in single line

In [12]:
def column(n):
    return n
column(income.columns)

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

## create a function to access a row based on a unique column value

In [36]:
print(income.values[0])

['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
 41381]

## create a function to find average income of all states from 2005 to 2013

In [13]:

def average():
    s=0
    c=0
    for i in range(2,11):
        for j in range(0,5):
            s+=income.values[j][i]
            c+=1
    avg=(s//c)
    print(avg)
average()

48525

## create a function to find the highest average income in the last three years

In [40]:
l=[]
def high():
    
    for i in range(8,11):
        
        c=0
        s=0
        high=0
        for j in range(0,5):
            s+=income.values[j][i]
            c+=1
        avg=(s//c)
        l.append(avg)
    return max(l)
high()

50113

##  create a function to find the lowest average income from 2007 to 2010(inclusive)

In [38]:
l=[]
def lower_avg():

    for i in range(4,8):
        s=0
        c=0
        low=0
        for j in range(0,5):
            s+=income.values[j][i]
            c+=1
        avg=s//c
        l.append(avg)
    return min(l)
        
            
lower_avg()

47709

## print the list of all the same line with average income less than california

In [31]:
l1=[]
l2=[]
for i in range(0,5):
    s=0
    c=0
    for j in range(2,11):
        s+=income.values[i][j]
        c+=1
    avg=s//c
    
    l1.append(avg)
for k in range(0,4):
    if l1[k]<l1[4]:
        for z in range(1,2):
            l2.append(income.values[k][z])
l2

['Alabama', 'Arizona', 'Arkansas']

## print the names of states based on descending order of their averages

In [10]:
l5=[]
for i in range(0,5):
    
    c=0
    s=0
    for j in range(2,11):
        
        s+=income.values[i][j]
        c+=1
    avg=s//c
    l5.append(avg)
    l5.sort(reverse=True)
print(l5)

[60106, 55350, 47214, 41126, 38828]

## state the lowest recorded income from 2005 to 2013

In [35]:
l3=[]
for i in range(2,11):
    for j in range(0,5):
        l3.append(income.values[j][i])
        
print(min(l3))

36538